---
kind: property
id: P:Autodesk.Revit.DB.UpdaterRegistry.IsValidObject
source: html/d8b34886-934d-8df5-6c24-c67f0de99b53.htm
---
# Autodesk.Revit.DB.UpdaterRegistry.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.